###############################################################################
# Created by write_sdc
###############################################################################
current_design ternary_cpu_system
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 3.3300 [get_ports {clk}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_addr[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_addr[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_addr[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_addr[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_addr[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_addr[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_addr[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_addr[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[4]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[4]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[5]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[5]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[6]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[6]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_addr[7]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_addr[7]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[0]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[10]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[10]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[11]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[11]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[12]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[12]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[13]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[13]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[14]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[14]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[15]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[15]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[16]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[16]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[17]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[17]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[1]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[2]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[3]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[4]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[4]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[5]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[5]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[6]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[6]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[7]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[7]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[8]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[8]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_data[9]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_data[9]}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_mode}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_mode}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {prog_we}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {prog_we}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {rst_n}]
set_input_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {rst_n}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[0]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[0]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[10]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[10]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[11]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[11]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[12]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[12]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[13]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[13]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[14]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[14]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[15]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[15]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[16]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[16]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[17]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[17]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[18]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[18]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[19]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[19]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[1]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[1]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[20]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[20]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[21]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[21]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[22]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[22]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[23]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[23]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[24]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[24]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[25]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[25]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[26]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[26]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[27]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[27]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[28]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[28]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[29]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[29]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[2]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[2]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[30]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[30]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[31]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[31]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[32]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[32]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[33]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[33]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[34]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[34]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[35]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[35]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[36]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[36]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[37]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[37]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[38]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[38]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[39]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[39]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[3]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[3]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[40]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[40]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[41]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[41]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[42]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[42]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[43]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[43]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[44]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[44]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[45]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[45]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[46]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[46]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[47]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[47]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[48]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[48]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[49]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[49]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[4]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[4]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[50]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[50]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[51]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[51]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[52]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[52]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[53]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[53]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[5]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[5]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[6]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[6]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[7]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[7]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[8]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[8]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {debug_reg_data[9]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {debug_reg_data[9]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {halted}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {halted}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[0]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[0]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[10]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[10]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[11]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[11]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[12]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[12]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[13]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[13]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[14]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[14]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[15]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[15]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[1]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[1]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[2]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[2]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[3]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[3]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[4]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[4]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[5]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[5]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[6]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[6]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[7]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[7]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[8]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[8]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -rise -max -add_delay [get_ports {pc_out[9]}]
set_output_delay 0.5000 -clock [get_clocks {core_clock}] -fall -max -add_delay [get_ports {pc_out[9]}]
set_false_path\
    -from [get_ports {rst_n}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
