OpenROAD 24Q3-11661-g86b9236cdd 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 32 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/ternary_cpu_system/base/3_1_place_gp_skip_io.odb
place_pins -hor_layers met3 -ver_layers met2
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 266
[INFO PPL-0002] Number of I/O             109
[INFO PPL-0003] Number of I/O w/sink      77
[INFO PPL-0004] Number of I/O w/o sink    32
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 968.78 um.
Elapsed time: 0:00.27[h:]min:sec. CPU time: user 0.24 sys 0.03 (100%). Peak memory: 111428KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            108 9d1c924ee79472045bf4
