###############################################################################
# Created by write_sdc
###############################################################################
current_design tritone_soc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1000.0000 [get_ports {clk}]
set_clock_uncertainty 30.0000 core_clock
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[0]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[10]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[11]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[12]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[13]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[14]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[15]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[16]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[17]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[18]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[19]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[1]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[20]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[21]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[22]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[23]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[24]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[25]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[26]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[27]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[28]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[29]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[2]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[30]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[31]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[3]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[4]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[5]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[6]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[7]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[8]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_addr[9]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_ren}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_sel}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[0]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[10]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[11]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[12]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[13]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[14]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[15]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[16]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[17]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[18]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[19]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[1]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[20]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[21]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[22]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[23]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[24]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[25]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[26]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[27]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[28]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[29]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[2]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[30]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[31]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[3]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[4]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[5]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[6]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[7]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[8]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wdata[9]}]
set_input_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_wen}]
set_input_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {rst_n}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {cpu_halted}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[0]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[10]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[11]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[12]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[13]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[14]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[15]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[16]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[17]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[18]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[19]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[1]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[20]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[21]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[22]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[23]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[24]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[25]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[26]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[27]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[28]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[29]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[2]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[30]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[31]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[3]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[4]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[5]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[6]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[7]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[8]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_rdata[9]}]
set_output_delay 300.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ext_ready}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {tpu_busy}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {tpu_done}]
set_output_delay 200.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {tpu_irq}]
set_false_path\
    -from [get_ports {rst_n}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
set_max_transition 80.0000 [current_design]
set_max_fanout 20.0000 [current_design]
