OpenROAD 24Q3-11673-g154f14ab7e 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 32 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/tritone/maxperf/3_1_place_gp_skip_io.odb
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
place_pins -hor_layers M4 -ver_layers M5
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 444
[INFO PPL-0002] Number of I/O             109
[INFO PPL-0003] Number of I/O w/sink      77
[INFO PPL-0004] Number of I/O w/o sink    32
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 235.70 um.
Elapsed time: 0:00.85[h:]min:sec. CPU time: user 0.79 sys 0.06 (100%). Peak memory: 192756KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            188 dca5677d6c2c69ff7407
