OpenROAD 24Q3-11673-g154f14ab7e 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 32 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/tritone/aggressive/1_synth.odb
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl

==========================================================================
Floorplan check_setup
--------------------------------------------------------------------------
number instances in verilog is 297
[WARNING IFP-0028] Core area lower left (2.000, 2.000) snapped to (2.052, 2.160).
[INFO IFP-0001] Added 29 rows of 150 site asap7sc7p5t.
source /OpenROAD-flow-scripts/flow/platforms/asap7/openRoad/make_tracks.tcl
source /OpenROAD-flow-scripts/flow/platforms/asap7/fastroute.tcl
Repair tie lo fanout...
[INFO RSZ-0042] Inserted 68 tie TIELOx1_ASAP7_75t_R instances.
Repair tie hi fanout...
[INFO RSZ-0042] Inserted 26 tie TIEHIx1_ASAP7_75t_R instances.
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -setup -skip_last_gasp -sequence unbuffer,sizeup,swap,buffer,vt_swap -verbose
[WARNING EST-0027] no estimated parasitics. Using wire load models.
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove 
[INFO RSZ-0098] No setup violations found
Default units for flow
 time 1ps
 capacitance 1fF
 resistance 1kohm
 voltage 1v
 current 1mA
 power 1pW
 distance 1um
Report metrics stage 2, floorplan final...

==========================================================================
floorplan final report_design_area
--------------------------------------------------------------------------
Design area 37 um^2 59% utilization.
Elapsed time: 0:00.99[h:]min:sec. CPU time: user 0.87 sys 0.14 (101%). Peak memory: 215168KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_1_floorplan                      0            210 1f9f1110b44e4f14e415
